Revit 2024 API
BRepBuilder.FinishFace Method
 Indicates that the caller has finished defining the given face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public void FinishFace(
	BRepBuilderGeometryId faceId
)
Visual Basic
Public Sub FinishFace ( _
	faceId As BRepBuilderGeometryId _
)
Visual C++
public:
void FinishFace(
	BRepBuilderGeometryId^ faceId
)
Parameters
faceId
Type: Autodesk.Revit.DB.BRepBuilderGeometryId
 Id of the face.
Remarks
 No functions that modify the given face's definition should be called after calling this function (e.g., AddLoop(BRepBuilderGeometryId), SetFaceMaterialId(BRepBuilderGeometryId, ElementId)). The BRepBuilder may take the opportunity to validate some of the face's data and report any problems it finds.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The supplied face id doesn't correspond to a face stored in this BRepBuilder object. -or- FinishFace() has already been called on faceId. -or- The face has no edge loops. -or- FinishLoop() must be called on all the edge loops of faceId.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BRepBuilder Class
Autodesk.Revit.DB Namespace